# 1st july tasks

In [553]:
import pandas as pd
dfp='DataFiles/Income.csv'
def readCsv(dfp):
    return pd.read_csv(dfp)
df=readCsv(dfp)
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [9]:
df.head(5)
df.tail(2)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [112]:
# df['State'][1]
# sum(df['2005']//len(df[:]))
# print(len(df[:]))

# def highestaverage(df):
#     avg=[]
#     for i in range(len(df.values)):
#         l=[]
#         for k in range(-1,-4,-1):
#             l.append(df.values[i][k])
#         avg.append([sum(l)//len(l),df.values[i][1]])
#     return avg
# m=highestaverage(df)
# k=max(m)
# k[-1]

# def lowestaverage(df):
#     avg=[]
#     for i in range(len(df.values)):
#         l=[]
#         for k in range(-1,-4,-1):
#             l.append(df.values[i][k])
#         avg.append([sum(l)//len(l),df.values[i][1]])
#     return avg
# m=lowestaverage(df)
# k=min(m)
# k[-1]
st=2
end=10
def averageIncome(df,st,end):
    #df.values[i][st],df.values[i][end]
    l=[]
    for i in range(len(df.values)):
        x=df.values[i][st:end+1]
#         print(sum(x)//len(x))
        l.append(sum(x)//len(x))
#         print(l)
#         for j in range(len(x)):
#             l.append(df.values[i][j])
    print(sum(l)//len(l))

averageIncome(df,2,10)

48524

In [48]:
# State with highest average income in the last three years
def getleastavg(df):
    avg=[]
    values=df.values
    for row in range(len(values)):
        l=[]
        for j in range(-1,-4,-1):
            l.append(values[row][j])
        avg.append([sum(l)//len(l),values[row][1]])
    return avg
avg_l=getleastavg(df)
x=max(avg_l)
print(x[1])

Alaska

In [93]:
#Combined Average Income of all states from 2005 to 2013
# def get_colindex(df,col):
#     columns=df.columns
#     for c in range(len(columns)):
#         if col == columns[c]:
#             return c
#     return
p=get_colindex(df,'2005') 
q=get_colindex(df,'2013')
def getdata(df,p,q):
    l=[]
    values=df.values
    for row in values:
        for j in range(p,q+1):
            print(row[j],end=" ")
            l.append(row[j])
        print()
    return sum(l)//len(l)
getdata(df,p,q)

37150 37952 42212 44476 39980 40933 42590 43464 41381
55891 56418 62993 63989 61604 57848 57431 63648 61137
45245 46657 47215 46914 45739 46896 48621 47044 50602
36658 37057 40795 39586 36538 38587 41302 39018 39919
51755 55319 55734 57014 56134 54283 53367 57020 57528

48525

In [50]:
# State with lowest average income from 2007 to 2010(inclusive)
p=get_colindex(df,'2007') 
q=get_colindex(df,'2010')
def getleastavg(df,p,q):
    avg=[]
    values=df.values
    for row in range(len(values)):
        l=[]
        for j in range(p,q):
            l.append(values[row][j])
        avg.append([sum(l)//len(l),values[row][1]])
    return avg
avg_l=getleastavg(df,p,q)
x=min(avg_l)
print(x[1])

Arkansas

In [ ]:
# Print the list of all states in the same line with average income less than California
p=get_colindex(df,'2005') 
q=get_colindex(df,'2013')
def avg(df,p,q,state):
    values=df.values
    avg=[]
    for r in range(len(values)):
        l=[]
        if state in values[r]:
            for j in range(p,q+1):
                l.append(values[r][j])
            avg.append([(),()])

In [168]:
def avg(df,state):
    k=[]
    for i in range(len(df.values)):
        if state in df.values[i]:
            for j in range(2,11):
                k.append(df.values[i][j])
            kavg=sum(k)//len(k)
    return kavg
c=avg(df,'California')
for k in df['State']:
    x=avg(df,k)
    if x < c:
        print(k,end=" ")

Alabama Arizona Arkansas

In [153]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [227]:
#Print the names of states based on descending order of income in the year 2009

def des(df):
    l=[]
    k=[]
    for i,j in zip(df['2009'],df['State']):
        l.append([i,j])
    sorted(l)
    print(l)
    print(min(l))
#     for i in range(len(l)):
# #         sorted(l[i][1])
#         print(l[i][1])
# #     k.append(df['State'])
des(df)

[[39980, 'Alabama'], [61604, 'Alaska'], [45739, 'Arizona'], [36538, 'Arkansas'], [56134, 'California']]
[36538, 'Arkansas']

In [228]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [348]:
# print(sum(df.loc[:,'2005']))
df.iloc[3][2]
df[['State','2009']]
# avg=df.mean(df[['2005','2013']])
k=df[1:]
# print(k.mean())
k.sum(1)

1    540959
2    424933
3    349460
4    498154
dtype: int64

In [373]:
m=df.iloc[0][:]
m

GEOID    04000US01
State      Alabama
2005         37150
2006         37952
2007         42212
2008         44476
2009         39980
2010         40933
2011         42590
2012         43464
2013         41381
Name: 0, dtype: object

In [468]:
print(df.loc[::])
# df

       GEOID       State   2005   2006   2007   2008   2009   2010   2011  \
0  04000US01     Alabama  37150  37952  42212  44476  39980  40933  42590
1  04000US02      Alaska  55891  56418  62993  63989  61604  57848  57431
2  04000US04     Arizona  45245  46657  47215  46914  45739  46896  48621
3  04000US05    Arkansas  36658  37057  40795  39586  36538  38587  41302
4  04000US06  California  51755  55319  55734  57014  56134  54283  53367

    2012   2013
0  43464  41381
1  63648  61137
2  47044  50602
3  39018  39919
4  57020  57528

In [475]:
df.sum(0)[2:]

2005    226699
2006    233403
2007    248949
2008    251979
2009    239995
2010    238547
2011    243311
2012    250194
2013    250567
dtype: object

In [703]:
# p=df.sum(0)[2:]
# p.mean()
# df.std()
# df.median()
# df.cumsum()
# df.mean()

# rc=(df.count(axis=0))
# print(rc)
# cc=(df.count(axis=1))
# cc=cc-2
# print(type(cc))
k=df.iloc[:,2:11]
sum_row=(df.sum(axis=1))//k.count(axis=1)
sum_col=(sum_row.sum(axis=0)//k.count(axis=0))
sum_col

2005    48524
2006    48524
2007    48524
2008    48524
2009    48524
2010    48524
2011    48524
2012    48524
2013    48524
dtype: int64

In [704]:
sum_row=(df.sum(axis=1))//9
sum_col=(sum_row.sum(axis=0)//5)
print(sum_col)

48524

In [554]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [647]:
# max1 = df['2009'].sort_values()
# max1
# df['State'][max1]
c=df[['State','2009']]
x=c.sort_values(by=['2009'])
print(list(x['State']))
# df.sort_"values(by['2009'])

['Arkansas', 'Alabama', 'Arizona', 'California', 'Alaska']

In [641]:
avg=df[:]
avg

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [639]:
# p=df[['State','2013','2012','2011']]
# d={}
# for i in range(len(p.values)):
#     print()
#     for j in range(1,4):
#         x=p.values[i][j]
#         d[i]=(x).mean()
#     print(d)
# list(p)
# print(p)

In [706]:
k=df.iloc[:,2:11]
k.count(axis=1)
# p=k.sum(axis=1)
# p.mean()
# p=k.sum(axis=1)//k.count(axis=1)
# s=k.sum(axis=0)//k.count(axis=1)
# p
# print(p,s)
# k

0    9
1    9
2    9
3    9
4    9
dtype: int64